Revit 2024 API
Transform2D.BasisU Property
 The image of (1, 0) under OfVector(UV).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public UV BasisU { get; set; }
Visual Basic
Public Property BasisU As UV
	Get
	Set
Visual C++
public:
property UV^ BasisU {
	UV^ get ();
	void set (UV^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Transform2D Class
Autodesk.Revit.DB Namespace